tutorials/multiRegion/film/cylinder/constant/fluid/cloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        reactingCloud;

libs        ("libfilmCloudTransfer.so");

solution
{
    coupled         no;
    transient       yes;
    cellValueSourceCorrection no;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            1000;
    T0              300;
    Cp0             4187;

    constantVolume  false;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            reactingLookupTableInjection;
            uniformParcelSize volume;
            SOI             0;
            inputFile       "parcelInjectionProperties";
            duration        20.0;
            parcelsPerSecond 50;
            randomise       true;
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel none;

    compositionModel singlePhaseMixture;

    phaseChangeModel none;

    stochasticCollisionModel none;

    surfaceFilmModel cloudFilmTransfer;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O         1;
            }
        );
    }

    cloudFilmTransferCoeffs
    {
        interactionType absorb;
    }
}


cloudFunctions
{}


// ************************************************************************* //
